balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1824T39A.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG_SHAD" edc:desc="" edc:mask="0xff" edc:name="WREG_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="BSR_SHAD" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="BSR_SHAD" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR_SHAD" edc:desc="" edc:mask="0x1f" edc:name="BSR_SHAD" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PCLATH_SHAD" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="PCLATH_SHAD" edc:nzwidth="8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLATH_SHAD" edc:desc="" edc:mask="0x7f" edc:name="PCLATH_SHAD" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0H_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR1L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1H_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR1H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="STKPTR" edc:desc="Current Stack pointer" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="STKPTR" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:desc="" edc:mask="0x1f" edc:name="STKPTR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSL" edc:desc="Top of Stack Low byte" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TOSL" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSL" edc:desc="" edc:mask="0xff" edc:name="TOSL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="TOSH" edc:desc="Top of Stack High byte" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="TOSH" edc:nzwidth="8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSH" edc:desc="" edc:mask="0x7f" edc:name="TOSH" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobank"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xA0" edc:endaddr="0xF0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xF0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x170" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1F0" edc:endaddr="0x200" edc:regionid="gpr3s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="4" edc:beginaddr="0x270" edc:endaddr="0x280" edc:regionid="gpr4s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0x2F0" edc:endaddr="0x300" edc:regionid="gpr5s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0x370" edc:endaddr="0x380" edc:regionid="gpr6s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0x3F0" edc:endaddr="0x400" edc:regionid="gpr7s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="8" edc:beginaddr="0x470" edc:endaddr="0x480" edc:regionid="gpr8s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="9" edc:beginaddr="0x4F0" edc:endaddr="0x500" edc:regionid="gpr9s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="10" edc:beginaddr="0x570" edc:endaddr="0x580" edc:regionid="gpr10s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="11" edc:beginaddr="0x5F0" edc:endaddr="0x600" edc:regionid="gpr11s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="12" edc:beginaddr="0x670" edc:endaddr="0x680" edc:regionid="gpr12s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="13" edc:beginaddr="0x6F0" edc:endaddr="0x700" edc:regionid="gpr13s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="14" edc:beginaddr="0x770" edc:endaddr="0x780" edc:regionid="gpr14s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="15" edc:beginaddr="0x7F0" edc:endaddr="0x800" edc:regionid="gpr15s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="16" edc:beginaddr="0x870" edc:endaddr="0x880" edc:regionid="gpr16s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="17" edc:beginaddr="0x8F0" edc:endaddr="0x900" edc:regionid="gpr17s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="18" edc:beginaddr="0x970" edc:endaddr="0x980" edc:regionid="gpr18s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="19" edc:beginaddr="0x9F0" edc:endaddr="0xA00" edc:regionid="gpr19s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="20" edc:beginaddr="0xA70" edc:endaddr="0xA80" edc:regionid="gpr20s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="21" edc:beginaddr="0xAF0" edc:endaddr="0xB00" edc:regionid="gpr21s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="22" edc:beginaddr="0xB70" edc:endaddr="0xB80" edc:regionid="gpr22s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="23" edc:beginaddr="0xBF0" edc:endaddr="0xC00" edc:regionid="gpr23s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="24" edc:beginaddr="0xC70" edc:endaddr="0xC80" edc:regionid="gpr24s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="25" edc:beginaddr="0xCF0" edc:endaddr="0xD00" edc:regionid="gpr25s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="26" edc:beginaddr="0xD70" edc:endaddr="0xD80" edc:regionid="gpr26s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="27" edc:beginaddr="0xDF0" edc:endaddr="0xE00" edc:regionid="gpr27s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="28" edc:beginaddr="0xE70" edc:endaddr="0xE80" edc:regionid="gpr28s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="29" edc:beginaddr="0xEF0" edc:endaddr="0xF00" edc:regionid="gpr29s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="30" edc:beginaddr="0xF70" edc:endaddr="0xF80" edc:regionid="gpr30s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="31" edc:beginaddr="0xFF0" edc:endaddr="0x1000" edc:regionid="gpr31s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:EmulatorZone edc:beginaddr="0xf8c" edc:endaddr="0xf93" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="P2A"/>
      <edc:VirtualPin edc:name="CCP2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="CPS3"/>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="CLKR"/>
      <edc:VirtualPin edc:name="SDO" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="P2B"/>
      <edc:VirtualPin edc:name="T1G" edc:ppsval="0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SS" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="T1G" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="Vpp"/>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="P1A"/>
      <edc:VirtualPin edc:name="CCP1"/>
      <edc:VirtualPin edc:name="DT" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="RX" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="MDCIN2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="SRNQ"/>
      <edc:VirtualPin edc:name="P1B"/>
      <edc:VirtualPin edc:name="CK" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="TX" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="MDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="CPS7"/>
      <edc:VirtualPin edc:name="C12IN3-"/>
      <edc:VirtualPin edc:name="P2A"/>
      <edc:VirtualPin edc:name="CCP2"/>
      <edc:VirtualPin edc:name="P1C"/>
      <edc:VirtualPin edc:name="SS" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="MDMIN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="CPS6"/>
      <edc:VirtualPin edc:name="C12IN2-"/>
      <edc:VirtualPin edc:name="P1D"/>
      <edc:VirtualPin edc:name="P2B"/>
      <edc:VirtualPin edc:name="SDO" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="MDCIN1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="CPS5"/>
      <edc:VirtualPin edc:name="C12IN1-"/>
      <edc:VirtualPin edc:name="SDA"/>
      <edc:VirtualPin edc:name="SDI"/>
      <edc:VirtualPin edc:name="P1C"/>
      <edc:VirtualPin edc:name="CCP4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="CPS4"/>
      <edc:VirtualPin edc:name="C2IN+"/>
      <edc:VirtualPin edc:name="SCL"/>
      <edc:VirtualPin edc:name="SCK"/>
      <edc:VirtualPin edc:name="P1D"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="CPS2"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="C1OUT"/>
      <edc:VirtualPin edc:name="SRQ"/>
      <edc:VirtualPin edc:name="CCP3"/>
      <edc:VirtualPin edc:name="FLT0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="CPS1"/>
      <edc:VirtualPin edc:name="C12IN0-"/>
      <edc:VirtualPin edc:name="Vref+"/>
      <edc:VirtualPin edc:name="SRI"/>
      <edc:VirtualPin edc:name="RX" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="DT" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
      <edc:VirtualPin edc:name="ICDCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="CPS0"/>
      <edc:VirtualPin edc:name="C1IN+"/>
      <edc:VirtualPin edc:name="Vref-"/>
      <edc:VirtualPin edc:name="DACOUT"/>
      <edc:VirtualPin edc:name="TX" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="CK" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
      <edc:VirtualPin edc:name="ICDDAT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
